# Sergey Panov
# Third exercise

"""
Создайте собственный класс-исключение, который должен проверять содержимое списка на
наличие только чисел. Проверить работу исключения на реальном примере. Запрашивать у
пользователя данные и заполнять список необходимо только числами. Класс-исключение
должен контролировать типы данных элементов списка.
Примечание: длина списка не фиксирована. Элементы запрашиваются бесконечно, пока
пользователь сам не остановит работу скрипта, введя, например, команду «stop». При этом
скрипт завершается, сформированный список с числами выводится на экран.
Подсказка: для этого задания примем, что пользователь может вводить только числа и строки.
Во время ввода пользователем очередного элемента необходимо реализовать проверку типа
элемента. Вносить его в список, только если введено число. Класс-исключение должен не
позволить пользователю ввести текст (не число) и отобразить соответствующее сообщение.
При этом работа скрипта не должна завершаться.
"""


class MyValueError(Exception):
    pass


number_list = []
while True:
    s = input("Please enter number or 'stop' to exit: ")
    if s.lower() == 'stop':
        break
    try:
        if not s.isdigit():
            raise MyValueError
        number_list.append(int(s))
    except MyValueError:
        print(f"{s} is not number")
print(f"Result list: {number_list}")
